tsung/initial.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="ec2-44-225-50-253.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <!-- visit the base page -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- go to login page -->
      <request>
        <http url='/sign_in' version='1.1' method='GET'></http>
      </request>

      <!-- go to to sign_up page and pull authenticity_token-->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/sign_up' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is filling out new user form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a random number to make a unique useremail -->
      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_user_email" />
      </setdynvars>

      <!-- make a user -->
      <request subst="true">
        <http url='/users' version='1.1' 
        contents='authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=test%%_random_user_email%%%40example.com&amp;user%5Bpassword%5D=test&amp;commit=Sign+Up'
        content_type='application/x-www-form-urlencoded' method='POST'></http>
      </request>

      <!-- Uncomment the following to debug print your dynamic variables  -->
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>


      
    </session>
  </sessions>
</tsung>

s6Ek71s9zDqqB+RcjVBL6mCtSWb8dW10ijhI6Y4WElB0eeyy/dl9NyaIthj+Dfq1/zBpnQ1fITgDfngIoWqfpg==