tsung/initial.xml
<?xml version="1.0"?>
<tsung loglevel="notice" version="1.0">
	<clients>
		<client host="localhost" use_controller_vm="true" maxusers="15000" />
	</clients>
	<servers>
		<server host="ec2-44-225-115-93.us-west-2.compute.amazonaws.com" port="80" type="tcp" />
	</servers>
	<load>
		<arrivalphase phase="1" duration="30" unit="second">
			<users arrivalrate="1" unit="second">
			</users>
		</arrivalphase>
		<arrivalphase phase="2" duration="30" unit="second">
			<users arrivalrate="2" unit="second">
			</users>
		</arrivalphase>
		<arrivalphase phase="3" duration="30" unit="second">
			<users arrivalrate="4" unit="second">
			</users>
		</arrivalphase>
		<arrivalphase phase="4" duration="30" unit="second">
			<users arrivalrate="8" unit="second">
			</users>
		</arrivalphase>
	</load>
	<options>
		<option name="glocal_ack_timeout" value="2000" />
		<option type="ts_http" name="user_agent">
			<user_agent probability="100">
				Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
				Firefox/1.0.4
			</user_agent>
		</option>
	</options>
	<sessions>
		<session name="http-example" probability="100" type="ts_http">
			<!-- start out at the dashboard. -->
			<request>
				<http url="/" version="1.1" method="GET">
				</http>
			</request>
		</session>
	</sessions>
</tsung>